app/Controllers/Usuarios.php

    public function index(){
        $data =  $this->usuarioModel->findAll();
---
SELECT *
FROM `usuarios`

    public function list($id = null){
        $data = $this->usuarioModel->where('id', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `us_id` = '1'
 LIMIT 1

    public function create(){
        $response = [];

        if($this->_validateToken() == true){
            $data['nome'] = $this->request->getPost('nome');
            $data['email'] = $this->request->getPost('email');
            $data['senha'] = $this->request->getPost('senha');

            try{
                if($this->usuarioModel->insert($data)){
---
INSERT INTO `usuarios` (`nome`, `email`, `senha`) VALUES ('Henrique', 'henrique@sistema.com', '456')

    public function update($id = null){
        $response = [];

        if($this->_validateToken() == true){

            $data = $this->request->getJSON();

            try{
                if($this->usuarioModel->update($id, $data)){
---
UPDATE `usuarios` SET `nome` = 'Gabriel', `email` = 'gabriel@sistema.com', `senha` = 'gab123'
WHERE `usuarios`.`id` IN ('7')

    public function delete($id = null){
        $response = [];

        if($this->_validateToken() == true){

            $data = $this->usuarioModel->find($id);

            try{
                if($data){
                    if($this->usuarioModel->where('id', $id)->delete($id)){
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '10'
DELETE FROM `usuarios`
WHERE `id` = '10'
AND `id` IN ('10')